In [1]:
import pandas as pd
import numpy as np

A pivot table allows us to create a new table (data frame) from a subset of an existing data frame.

In [4]:
g = np.random.default_rng(0)

In [10]:
df = pd.DataFrame(g.integers(0, 100, [8,3]),
              columns=list('ABC'))

In [11]:
df['year'] = [2018] * 4 + [2019] * 4

In [12]:
df['quarter'] = 'Q1 Q2 Q3 Q4'.split() * 2

This table shows the sales of each product per year and quarter. And you can certainly understand the data if you look at it a certain way. ``But what if we were interested in seeing sales figures for product A?`` It may make more sense, and be easier to parse, ``if we use the quarters (a categorical, repeating value) as the rows, the years (again, a categorical, repeating value) as the columns``, and the figures for product A as the values. We can create such a pivot table as follows:

In [13]:
df

    A   B   C  year quarter
0  39  85  55  2018      Q1
1   3  76  72  2018      Q2
2  84  17   8  2018      Q3
3  86   2  54  2018      Q4
4   8  29  48  2019      Q1
5  42  40   2  2019      Q2
6   0  12   0  2019      Q3
7  67  52  64  2019      Q4

In [15]:
df.pivot_table(index='quarter',
                columns='year',
                values='A')

year     2018  2019
quarter
Q1       39.0   8.0
Q2        3.0  42.0
Q3       84.0   0.0
Q4       86.0  67.0

In [ ]:
df.pivot_table(index='year',
                columns='quarter',
                values='A') # I am just playing around

quarter    Q1    Q2    Q3    Q4
year
2018     39.0   3.0  84.0  86.0
2019      8.0  42.0   0.0  67.0

The quarters are sorted in alphabetical order, which is fine here. In some cases, such as using month names for your index, you can pass sort=False.

In [17]:
df.pivot_table(index='quarter',
                columns='year',
                values='A',
                sort=False,
                aggfunc='size'    
                )

year     2018  2019
quarter
Q1          1     1
Q2          1     1
Q3          1     1
Q4          1     1